/**
 * Created by Epulari T on 2018/8/2.
 */

//插入排序
function InsertionSort(arr) {
	//外层循环：一轮比较。每次已排序列多一个元素，i代表已排序列元素的最大索引，最开始只有一个元素arr[0]
	for(var i = 0, len = arr.length; i < len - 1; i++) {
		//内层循环：进行每轮的单个元素比较。待排元素为已排元素的下一个值arr[i + 1]，即arr[j]，将之与已排元素进行比较
		for (var j = i + 1; j > 0; j--) {
			//如果待排元素小于已排序数则交换两个数
			if (arr[j] < arr[j - 1]) {
				var temp = arr[j - 1];
				arr[j - 1] = arr[j];
				arr[j] = temp;
			}
			//待排元素不小于已排序数说明已完成本轮排序，跳出循环
			else {
				break;
			}
		}
		console.log(arr);
	}
}

var arr = [7, 26, 53, 22, 32, 28, 38, 23, 24, 54, 27, 78, 33];
InsertionSort(arr);

/*result
[ 7, 26, 53, 22, 32, 28, 38, 23, 24, 54, 27, 78, 33 ]
[ 7, 26, 53, 22, 32, 28, 38, 23, 24, 54, 27, 78, 33 ]
[ 7, 22, 26, 53, 32, 28, 38, 23, 24, 54, 27, 78, 33 ]
[ 7, 22, 26, 32, 53, 28, 38, 23, 24, 54, 27, 78, 33 ]
[ 7, 22, 26, 28, 32, 53, 38, 23, 24, 54, 27, 78, 33 ]
[ 7, 22, 26, 28, 32, 38, 53, 23, 24, 54, 27, 78, 33 ]
[ 7, 22, 23, 26, 28, 32, 38, 53, 24, 54, 27, 78, 33 ]
[ 7, 22, 23, 24, 26, 28, 32, 38, 53, 54, 27, 78, 33 ]
[ 7, 22, 23, 24, 26, 28, 32, 38, 53, 54, 27, 78, 33 ]
[ 7, 22, 23, 24, 26, 27, 28, 32, 38, 53, 54, 78, 33 ]
[ 7, 22, 23, 24, 26, 27, 28, 32, 38, 53, 54, 78, 33 ]
[ 7, 22, 23, 24, 26, 27, 28, 32, 33, 38, 53, 54, 78 ]
[Finished in 0.2s]
 */